{
  "item.shape-shifter-curse.cursed_book_of_shape_shifter": ["Strange book"],
  "screen.shape-shifter-curse.start_book.start_button_text": ["TestButton"],
  "info.shape-shifter-curse.before_cursed_moon": ["You feel that the magic in your body is surging. The next night, the cursed moon will rise..."],
  "info.shape-shifter-curse.on_cursed_moon": ["The magic in your body has begun to surge. The cursed moon has risen"],
  "entity.shape-shifter-curse.t_bat": ["Bat?"],
  "item.shape-shifter-curse.custom_bat_spawn_egg": ["Bat? Spawn Egg"],
  "effect.shape-shifter-curse.to_bat_0_effect": [
    "...that strange",
    {
      "text": "bat", "color": "#0096FF"
    },
    "?"
  ],
  "effect.shape-shifter-curse.to_bat_0_effect.description": [
    "You suddenly feel very",
    {
      "text": "sleepy", "color": "#0096FF"
    },
    ", maybe you should",
    {
      "text": "take a nap", "color": "yellow"
    },
    "?"
  ],
  "commands.shape-shifter-curse.form_not_found": ["Form not found!"],
  "codex.header.status": ["Status"],
  "codex.header.appearance": ["Appearance"],
  "codex.header.pros": ["Pros"],
  "codex.header.cons": ["Cons"],
  "codex.header.instincts": ["Instincts"],
  "codex.status.normal": ["Currently, you feel nothing special"],
  "codex.status.infected": ["For some reason, you suddenly feel a strange",
    {
      "text": "drowsiness", "color": "#0096FF"
    },
    ", and you feel that the magic in your body is changing\nMaybe you should",
    {
      "text": "take a nap", "color": "yellow"
    },
    "?"],
  "codex.status.before_moon": ["You feel that the magic in your body is surging, and the next night, the cursed moon will rise..."],
  "codex.status.under_moon": ["The influence of the cursed moon has changed your body...\nAs the night ends, this influence will also fade. But... maybe you should take advantage of this opportunity?"],
  "codex.desc.appearance_normal": ["Your body feels no different from usual. Perhaps the chant you recited needs some kind of trigger to take effect?"],
  "codex.desc.pros_normal": ["Currently, the magic in your body has not brought you any perceivable benefits"],
  "codex.desc.cons_normal": ["Currently, the magic in your body has not brought you any disadvantages"],
  "codex.desc.instincts_normal": ["Examine your heart, you do perceive some kind of magic in your body, but that's all.\nYour heart is calm, maintaining a perception of the surrounding environment"],
  "codex.desc.appearance_0": ["Due to the resonance of the magic in your body with other creatures, your body has undergone some changes. At this stage, a golden apple is enough to completely reverse it..."],
  "codex.desc.pros_0": ["Your new form gives you some additional abilities..."],
  "codex.desc.cons_0": ["At the same time, your new form also brings some inconveniences..."],
  "codex.desc.instincts_0": ["Instincts from other creatures invade your heart\nIf you insist on resisting them, the unstable magic in your body may further change your body..."],
  "codex.desc.appearance_1": ["The intensified magic has further changed your body. You perceive that it is trying to reach a new equilibrium, a state that is completely different from your original self.\nPerhaps it is a good idea to reverse it with a golden apple before it enters the next stage..."],
  "codex.desc.pros_1": ["Your new form gives you more additional abilities..."],
  "codex.desc.cons_1": ["At the same time, your new form also brings some new inconveniences..."],
  "codex.desc.instincts_1": ["The influence of the instincts of other creatures in your heart is becoming more and more obvious\nIf you insist on resisting them, the unstable magic in your body may further change your body..."],
  "codex.desc.appearance_2": ["The magic in your body has almost completely changed you. It has reached a new stable state, and even a golden apple is of no avail..."],
  "codex.desc.pros_2": ["Your form has these powers"],
  "codex.desc.cons_2": ["At the same time, your form also has some inconvenient places..."],
  "codex.desc.instincts_2": ["Your instincts no longer bother you, they have become a part of you"],
  "codex.form.original.title": ["Overall, in the eyes of others, you are a completely normal human"],
  "codex.form.original.appearance": [" "],
  "codex.form.original.pros": [" "],
  "codex.form.original.cons": [" "],
  "codex.form.original.instincts": [" "],
  "codex.form.bat0.title": ["Overall, if you manage to hide the anomalies on your body, others will think you are a bit of a strange human"],
  "codex.form.bat0.appearance": ["Your arms extend membranous appendages on the outside, feeling a bit like a bat\nYour coccyx also protrudes outward to form a small tail\nBut other than that, they seem to have little practical function"],
  "codex.form.bat0.pros": ["When in the dark, you feel more agile in your actions"],
  "codex.form.bat0.cons": ["You can no longer wear chest armor: your new appendages make them ill-fitting."],
  "codex.form.bat0.instincts": ["Stay in the dark makes you feel",
    {
      "text":"comfortable", "color":"green"
    },"\n\nThe idea of eating fruit makes you feel",
    {
      "text":"comfortable", "color":"green"
    },"\n\nThe idea of being surrounded by dripping stones or stalactites makes you feel",
    {
      "text":"comfortable", "color":"green"
    },"\n\nThe idea of staying in the sun makes you feel",
    {
      "text":"uncomfortable", "color":"red"
    }],
  "codex.form.bat1.title": ["Overall, the abnormalities on your body are now too obvious to hide. Others might think you belong to an alien race."],
  "codex.form.bat1.appearance": [
    "Your ears are now located on top of your head, large and pointed, facing forward.\n",
    "The membrane-covered appendages on your arms have grown longer. When you jump, you find yourself involuntarily flapping them.\n",
    "Your fingers have become claw-like, making fine manipulations difficult. However, you can still grasp items normally.\n",
    "Your toes have elongated and spread outward.\n",
    "Your tail has grown significantly longer.\n",
    "You seem to have shrunk in size slightly.\n",
    "Due to the shift in your center of gravity, you now squat on the ground involuntarily when crouching."
  ],
  "codex.form.bat1.pros": [
    "You can now clearly distinguish objects in the dark.\nYour arms have become stronger, enhancing your melee attack power.\nThough still unable to fly, flapping your membranes allows you to jump higher.\nWhen in shadowed areas, you feel more agile and swift."
  ],
  "codex.form.bat1.cons": [
    "Your finger structure now makes using bows or crossbows nearly impossible.\nThe membranes and new toe structure prevent wearing chest armor or shoes.\nIn sunlight, you feel weaker and slower.\nYour body no longer efficiently digests meat; they provide less satiety."
  ],
  "codex.form.bat1.instincts": [
    "The thought of staying in the dark makes you feel",
    {
      "text": "comfortable", "color": "green"
    },
    "\nThe idea of eating some fruit makes you feel",
    {
      "text": "comfortable", "color": "green"
    },
    "\nThe thought of being surrounded by dripstone or stalagmites makes you feel",
    {
      "text": "comfortable", "color": "green"
    },
    "\n\nThe idea of staying in sunlight makes you feel",
    {
      "text": "uncomfortable", "color": "red"
    },
    "\nThe thought of eating meat makes you feel",
    {
      "text": "uncomfortable", "color": "red"
    },
    "\nThe idea of sleeping and wasting a beautiful night makes you feel",
    {
      "text": "uncomfortable", "color": "red"
    }
  ],
  "codex.form.bat2.title": [
    "Overall, others would see you as a large, strange bat."
  ],
  "codex.form.bat2.appearance": [
    "Your ears now dominate your head, allowing detection of the faintest sounds.\nYour face has developed into a short muzzle with sharp small teeth visible.\nYour arms have become part of the membrane. While still too heavy for flight, they suffice for controlled descents and dives.\nYour forelimbs are no longer suited for tool or weapon use; their strength is in their hardness and sharpness.\nNew claws, digitigrade legs, and a balancing tail make you well-suited for diving and gliding. You can still run with effort.\nSquatting on the ground is your most natural posture.\nIn cold caves, your fur helps maintain warmth."
  ],
  "codex.form.bat2.pros": [
    "You can distinguish objects in darkness. In shadowed areas, you feel more agile and swift.\nYour forelimbs are hard and strong, allowing significant unarmed damage. They also enable fast blockbreaking and harvesting of ores normally.\nThough still unable to fly, flapping membranes allows higher jumps and controlled descents from any height; they can function as elytra.\nYou are now small enough to fit through one-block spaces; though larger than other similar creatures."
  ],
  "codex.form.bat2.cons": [
    "Your forelimbs cannot grip heavy tools or weapons; using them on hard blocks or attacking causes them to slip off.\nUsing using bows or crossbows is impossible with your current claw structure.\nThe membrane and digitigrade legs prevent wearing chestplate, leggings, or boots. They also slightly slow ground movement.\nSunlight weakens and slows you considerably.\nYou can no longer eat meat; your body cannot digest it."
  ],
  "codex.form.bat2.instincts": [
    " "
  ]
}